gordonthree/esp32-canbus-node-v3/src/main.cpp
/**
 * @file main.cpp
 * @brief Gateway controller for CAN-based ARGB and Vehicle Control system.
 * @details Handles Wi-Fi/OTA, TWAI (CAN) hardware lifecycle, and node discovery.
 * Acts as the bridge between the CYD UI and the distributed hardware nodes.
 * Additional roles: ARGB LED control
 * Planned roles: Interface with i2c and SPI sensors, LCD and OLED displays, and button / keypad input
 *
 * @author Gordon McLellan
 */

 /* === Framework includes === */
#include <Arduino.h>
#include <ArduinoOTA.h>

/* === ESP32 includes === */
#include <Preferences.h>
#include <rom/crc.h>
#include <WiFi.h>
#include <ESPmDNS.h>
#include <esp_wifi.h>
#include <time.h>
/* === Standard library includes === */
#include <stdio.h>
#include <stddef.h>
/* === ESP32 native IDF includes === */
#include "driver/twai.h" /* esp32 native TWAI CAN library */
#include "driver/ledc.h" /* esp32 native LEDC PWM library */
#include "esp_err.h"     /* esp32 error handler */

/* === FreeRTOS includes === */
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>

#ifdef ARGB_LED
/* Load NeoPixelBus */
#include <NeoPixelBus.h>
#endif

/* === Local includes === */
#include "canbus_project.h"    /**< my various CAN functions and structs */
#include "secrets.h"           /**< WiFi credentials and such */
#include "can_router.h"        /**< CAN routing (subcriber) routines and constants */
#include "can_producer.h"      /**< CAN producer routines and constants */
#include "can_platform.h"      /**< CAN platform routines and constants */
#include "personality_table.h" /**< Node and sub-module personality table */
#include "node_state.h"        /**< Node and sub-module state table */
#include "storage.h"           /**< NVS storage routines */
#include "submodule_types.h"   /**< Sub-module type definitions */

/* my byte routines */
#include "byte_conversion.h"

/* hardware constants */
#include "esp32_defs.h"

#ifdef ESP32CYD
#include "espcyd.h"
#endif

/* my colors */
#if defined(ARGB_LED) || defined(ESP32CYD) || defined(ARGBW_LED)
#include "colorpalette.h"
#endif

/* memory allocation for main tasks */
#define TASK_TWAI_STACK_SIZE   (4096U)
#define TASK_OTA_STACK_SIZE    (4096U)
#define TASK_SWITCH_STACK_SIZE (4096U)
#define tskLowPriority         (tskIDLE_PRIORITY + 1)
#define tskNormalPriority      (tskIDLE_PRIORITY + 2)
#define tskHighPriority        (tskIDLE_PRIORITY + 4)

#define CAN_ID_MASK            (0x3F)      /**< Mask for lower 6 bits of CAN ID */
#define PWM_RES_BITS           (8U)        /**< 8-bit resolution for PWM */
#define DEFAULT_TIMEZONE       "EST5EDT,M3.2.0,M11.1.0"
#define ENV_VAL_OVERWRITE      (1U)

#define CRC_INVALID_CONFIG     (0xFFFF)
#define SUBMOD_PART_B_FLAG     (0x80U)

/* Default CAN transceiver pins */
#ifndef RX_PIN
#define RX_PIN 22
#endif

#ifndef TX_PIN
#define TX_PIN 21
#endif

#ifndef NODEMSGID
#define NODEMSGID 0x701
#endif

/* CAN bus polling intervals */
#define TRANSMIT_RATE_MS (100U)
#define POLLING_RATE_MS  (100U)

/* WiFi Constants */
#define AP_SSID  "canesp32"

/* Connect node state functions to producer library callback table */
static const producerCallbacks_t producerCB = {
    .getSubModuleCount = nodeGetSubModuleCount,
    .getSubModule      = nodeGetSubModule,
    .getRuntime        = nodeGetRuntime
};

outputTracker_t trackers[MAX_SUB_MODULES];

struct blinkerTracker_t {
    uint32_t     freq;              /**< LEDC frequency in Hertz */
    uint8_t      hwPin;             /**< Hardware pin */
    uint8_t      subIdx;            /**< Node submodule index */
    bool         isActive;          /**< Flag to indicate blinker is outputting a signal */
};

blinkerTracker_t blinkers[LEDC_MAX_TIMERS];
uint8_t pwmPins[LEDC_MAX_TIMERS];        /**< Array to track PWM pins */

SemaphoreHandle_t flashMutex = xSemaphoreCreateMutex(); /**< mutex for flash safety */

/* Task handles */
TaskHandle_t xTWAIHandle   = NULL; /* declared and defined */
TaskHandle_t xSwitchHandle = NULL; /**< Handle for the output switch logic task */

/* definitions from external libraries */
#ifdef ESP32CYD
// extern int discoveredNodeCount; /**< Track active count in the array */
// extern const int MAX_ARGB_NODES;
// extern ARGBNode discoveredNodes[];
#endif

/** Runtime data storage */
submoduleRuntime_t g_subRuntime[MAX_SUB_MODULES];

/* memory allocation for the flags */
uint8_t FLAG_SEND_INTRODUCTION = 0;
uint8_t FLAG_BEGIN_NORMAL_OPER = 0;
uint8_t FLAG_HALT_NORMAL_OPER  = 0;
uint8_t FLAG_SEND_HEALTHCHECK  = 0;
uint8_t FLAG_SEND_NODECHECK    = 0;
uint8_t FLAG_PRINT_TIMESTAMP   = 0;

/* OTA task control */
volatile bool ota_enabled  = false;
volatile bool ota_started  = false;
const char*   ota_password = OTA_PASSWORD; // change this

/* dynamic discovery stuff */
nodeInfo_t node; /**< Store information about this node */

volatile uint16_t node_crc = 0xffff; /**< CRC-16 for the node configuration */
volatile int introMsgPtr;  /**< Pointer for the introduction and interview process */

volatile bool FLAG_ARGB_CONFIG     = false;
volatile bool can_suspended        = false;
volatile bool can_driver_installed = false;
volatile bool FLAG_VALID_CONFIG    = false; /**< Clear the flag indicating a valid configuration  */

unsigned long previousMillis = 0;  /* will store last time a message was sent */
unsigned long lastCanError   = 0;  /* will store last time a CAN error occurred */

String wifiIP;

static const char *TAG = "canesp32";

/* interrupt stuff */
hw_timer_t *Timer0_Cfg = NULL;

const char* ssid = SECRET_SSID;
const char* password = SECRET_PSK;
const char* hostname =AP_SSID;

volatile int i=4;
volatile bool isrFlag=false;
volatile bool ipaddFlag=true;

int period = 1000;
int8_t ipCnt = 0;

unsigned long time_now = 0;

#ifdef ARGB_LED
/* Global strip pointers to allow for dynamic initialization */
// NeoPixelBus<NeoGrbFeature, NeoEsp32Rmt0800KbpsMethod>* strip = NULL;
NeoPixelBus<NeoGrbFeature, NeoEsp32Rmt0800KbpsMethod>* g_argbStrips[MAX_SUB_MODULES] = { nullptr };
#endif

unsigned long ota_progress_millis = 0;

volatile bool wifi_connected = false;
volatile uint8_t myNodeID[NODE_ID_SIZE]; /**< node ID comprised of four bytes from MAC address */

void IRAM_ATTR Timer0_ISR()
{
  isrFlag = true;
}



/**
 * @brief Handles specialized FastLED initialization for ARGB sub-modules.
 * @param index The sub-module index (used to index ledData arrays).
 * @param sub   Reference to the sub-module configuration.
 */
void initArgbHardware(uint8_t index, subModule_t& sub)
{
#ifdef ARGB_LED
    if (index >= MAX_SUB_MODULES) return;

    uint8_t  dataPin    = sub.config.argb.colorOrder; // or dedicated pin field
    uint16_t pixelCount = sub.config.argb.ledCount;

    if (pixelCount > MAX_PIXEL_COUNT)
        pixelCount = MAX_PIXEL_COUNT;

    /* Free old strip if reinitializing */
    if (g_argbStrips[index] != nullptr)
        delete g_argbStrips[index];

    /* Allocate new strip */
    g_argbStrips[index] =
        new NeoPixelBus<NeoGrbFeature, NeoEsp32Rmt0800KbpsMethod>(pixelCount, dataPin);

