gordonthree/esp32-canbus-node-v3/src/main.cpp
    if (g_argbStrips[index] != nullptr)
    {
        g_argbStrips[index]->Begin();
        g_argbStrips[index]->Show();
        Serial.printf("ARGB Init: submod %d pin %d count %d\n", index, dataPin, pixelCount);
    }
    else
    {
        Serial.printf("ARGB Init FAILED: submod %d pin %d count %d\n", index, dataPin, pixelCount);
    }
#endif
}


/**
 * @brief Initializes digital inputs such as physical switches and buttons.
 * @param i          The sub-module index (used to index submodule array).
 * @param sub        Reference to the sub-module configuration.
 * @details Configure the pull-up/pull-down resistor and initialize the input pin.
 * @note This function is called by the initHardware() function during setup().
 */
void initGPIOInput(uint8_t i, subModule_t& sub) {
  const personalityDef_t* p = getPersonality(sub.personalityId); /**< Pointer to the personality definition for this sub-module */

  if (sub.config.gpioInput.pull == INPUT_RES_PULLUP) { /* INPUT_RES_PULLUP */
      pinMode(p->gpioPin, INPUT_PULLUP);
      Serial.printf("Submod %d: Digital Input Init Pull-Up (Pin %d)\n", i, p->gpioPin);
  } else if (sub.config.gpioInput.pull == INPUT_RES_PULLDOWN) { /* INPUT_RES_PULLDOWN */
      pinMode(p->gpioPin, INPUT_PULLDOWN);
      Serial.printf("Submod %d: Digital Input Init Pull-Down (Pin %d)\n", i, p->gpioPin);
  } else { /* INPUT_RES_FLOATING */
      pinMode(p->gpioPin, INPUT);
      Serial.printf("Submod %d: Digital Input Init Floating (Pin %d)\n", i, p->gpioPin);
  }
}

/**
 * @brief Initializes a PWM output sub-module.
 * @details This function is responsible for setting up the ESP32 LEDC driver for a PWM output sub-module.
 * The function takes two parameters: the index of the sub-module and a reference to the sub-module configuration.
 * The function sets up the LEDC driver with the channel set to the index, the frequency set to the configured frequency
 * multiplied by the PWM scaling factor, and the resolution set to 8-bit.
 * The function then attaches the PWM output pin to the LEDC driver and stores the pin number in the pwmPins array.
 * Finally, the function prints a debug message indicating the sub-module index, the PWM output pin, and the configured frequency.
 * @param i Index of the output switch / submodule.
 * @param sub Reference to the sub-module configuration.
 */
void initPwmHardware(uint8_t i, subModule_t& sub) {
  const personalityDef_t* p = getPersonality(sub.personalityId); /**< Pointer to the personality definition for this sub-module */

  /* Handle the name change between IDF versions */
    #if !defined(LEDC_USE_RC_FAST_CLK)
        #define LEDC_USE_RC_FAST_CLK LEDC_USE_RTC8M_CLK
    #endif

  /* ESP32 LEDC setup: channel = i, frequency = config * 100, resolution = 8-bit */
    uint32_t freq = (double)(sub.config.gpioOutput.param1 * PWM_SCALING_FACTOR);
    uint8_t channel = i;

    ledc_timer_config_t ledc_timer = {
        .speed_mode       = LEDC_LOW_SPEED_MODE,
        .duty_resolution  = LEDC_TIMER_8_BIT,
        .timer_num        = (ledc_timer_t)(channel / 8), /**< 8 channels per group */
        .freq_hz          = freq,
        .clk_cfg          = LEDC_USE_RC_FAST_CLK, /**< Use 8MHz clock instead of 80MHz */
    };
    ledc_timer_config(&ledc_timer);

    // ledcSetup(i, (uint32_t)sub.config.pwmOutput.pwmFreq * PWM_SCALING_FACTOR, PWM_RES_BITS);
    // ledcAttachPin(sub.config.pwmOutput.outputPin, i);

    ledcAttachPin(p->gpioPin, channel);
    ledc_channel_config_t ledc_ch = {
        .gpio_num       = p->gpioPin,
        .speed_mode     = LEDC_LOW_SPEED_MODE,
        .channel        = (ledc_channel_t)channel,
        .intr_type      = LEDC_INTR_DISABLE,
        .timer_sel      = (ledc_timer_t)(channel / 8),
        .duty           = 0,
        .hpoint         = 0
    };
    ledc_channel_config(&ledc_ch);


    pwmPins[i] = p->gpioPin; /* Store the pin number in the pwmPins array */
    Serial.printf("Submod %d: PWM Output Init (Pin %d, Freq %d)\n", i, p->gpioPin, (sub.config.gpioOutput.param1 * PWM_SCALING_FACTOR));
}

/**
 * @brief Clears a PWM pin's configuration and detaches it from the LEDC driver.
 * @details This function is typically called when a sub-module is deinitialized.
 * @param i Index of the output switch / submodule.
 */
void clearPwmHardware(uint8_t i) {
    ledcDetachPin(pwmPins[i]);
    pwmPins[i] = 0;
}

void initGpioOutput(uint8_t i, subModule_t& sub) {
  const personalityDef_t* p = getPersonality(sub.personalityId); /**< Pointer to the personality definition for this sub-module */

  pinMode(p->gpioPin, OUTPUT);
  Serial.printf("Submod %d: Digital Output Init (Pin %d)\n", i, p->gpioPin);
} 

void initAnalogInput(uint8_t i, subModule_t& sub) {
  const personalityDef_t* p = getPersonality(sub.personalityId); /**< Pointer to the personality definition for this sub-module */

  pinMode(p->gpioPin, ANALOG);
  Serial.printf("Submod %d: Analog Input Init (Pin %d)\n", i, p->gpioPin);
}

/**
 * @brief Initializes all sub-modules based on their intro message IDs.
 * @details Iterates through the sub-module array and calls the appropriate init function based on the intro message ID.
 * @note This function is called once by the main setup() function.
 */
void initHardware() {
  Serial.println("[HW] Initializing sub-modules...");

  for (int i = 0; i < MAX_SUB_MODULES; i++) {
    subModule_t& sub = node.subModule[i];
    const personalityDef_t* p = getPersonality(sub.personalityId); /**< Pointer to the personality definition for this sub-module */

    if (sub.introMsgId == 0) continue;

    switch (sub.introMsgId) {
      case DISP_ARGB_BACKLIGHT_ID:
      case DISP_ARGB_LED_STRIP_ID:
      case DISP_ARGB_BUTTON_BACKLIGHT_ID:
        initArgbHardware(i, sub);
        break;

      case INPUT_DIGITAL_GPIO_ID:
        initGPIOInput(i, sub);
        break;

      case OUT_GPIO_DIGITAL_ID:
      case DISP_ANALOG_BACKLIGHT_ID:
      case DISP_ANALOG_LED_STRIP_ID:
      case DISP_MONOCHROME_LED_ID:
      case DISP_STROBE_MODULE_ID:
        trackers[i].isConfigured = true; /* Mark as configured for the output task (blink, strobe and momentary) */
        initGpioOutput(i, sub);
        break;

      case OUT_GPIO_PWM_ID:
        initPwmHardware(i, sub);
        break;

      case INPUT_ANALOG_ADC_ID:
        initAnalogInput(i, sub);
        break;

      case DISP_TOUCHSCREEN_LCD_ID:
        /* Touchscreen init here if needed */
        Serial.printf("Submod %d: Touchscreen LCD Identified\n", i);
        break;

      default:
        /* No hardware init available */
        Serial.printf("Submod %d: No hardware init available for ID 0x%03X\n", i, sub.introMsgId);
        break;
    } /* switch (sub.introMsgId) */
  } /* for (int i = 0; i < MAX_SUB_MODULES; i++) */
} /* initHardware() */

/**
 * @brief Calculates a 16-bit CRC for the node configuration.
 * @details Uses the ESP32 ROM CRC16 implementation (CCITT).
 * @param node Reference to the canNodeInfo struct.
 * @return uint16_t The calculated checksum.
 */
uint16_t crc16_ccitt(const uint8_t* data, size_t length) {
  uint16_t crc = 0xFFFF; // Initial value
  while (length--) {
    crc ^= (uint16_t)*data++ << 8;
    for (int i = 0; i < 8; i++) {
      if (crc & 0x8000) {
        crc = (crc << 1) ^ 0x1021; // Polynomial
      } else {
        crc <<= 1;
      }
    }
  }
  return crc;
}

/**
 * @brief Calculates a 16-bit CRC for the entire node configuration.
 */
const uint16_t getConfigurationCRC(const nodeInfo_t& node) {
  /* Hash the entire struct without worrying about internal fields */
  return crc16_ccitt((const uint8_t*)&node, sizeof(nodeInfo_t));
}

const uint16_t getSubModuleCRC(const subModule_t& sub) {
  /* Hash the submodule only */
  return crc16_ccitt((const uint8_t*)&sub, sizeof(subModule_t));
}

void TaskOTA(void *pvParameters) {
  /* Wait until WiFi is connected */
  while (!wifi_connected) {
    vTaskDelay(200 / portTICK_PERIOD_MS);
  }

  Serial.println("[RTOS] OTA task started.");

  /* Configure ArduinoOTA */
  ArduinoOTA.setHostname(hostname);
  ArduinoOTA.setPassword(ota_password);

  ArduinoOTA.onStart([]() {
    can_suspended = true; /* Stop the task logic */

    /* stop timer0 isr if running */
    if (Timer0_Cfg != NULL) {
      timerAlarmDisable(Timer0_Cfg);
      timerDetachInterrupt(Timer0_Cfg);
    }

    /* 1. Kill the tasks using hardware first */
    if (xTWAIHandle != NULL) vTaskSuspend(xTWAIHandle); /* suspend the TWAI task */
    if (xSwitchHandle != NULL) vTaskSuspend(xSwitchHandle); /* suspend the output switch task */
#ifdef ESP32CYD
    if (xDisplayHandle != NULL) vTaskSuspend(xDisplayHandle); /* suspend the display task */
    if (xTouchHandle != NULL) vTaskSuspend(xTouchHandle); /* suspend the touch task */
#endif
    /* Stop the TWAI driver */
    twai_stop();

    Serial.println("OTA Start: Background tasks suspended, starting flash... ");
  });
  ArduinoOTA.onEnd([]() {
    Serial.println("\nOTA End");
  });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    Serial.print(".");
  });
  ArduinoOTA.onError([](ota_error_t error) {
    Serial.printf("OTA Error[%u]\n", error);
    ESP.restart(); /* Cleanest way to recover CAN hardware after a failed OTA */
  });

  /* Option A: Always enable OTA listener */
  ArduinoOTA.begin();
  ota_started = true;
  Serial.println("[OTA] OTA library ready");

  /* Main loop: handle OTA requests */
  for (;;) {
    ArduinoOTA.handle();
    vTaskDelay(pdMS_TO_TICKS(5));
  }

  vTaskDelete(NULL);
}


/**
 * @brief Reads the ESP32 station MAC address and extracts a 4-byte Node ID.
 */
void readMacAddress() {
  uint8_t baseMac[6];
  esp_efuse_mac_get_default(baseMac); /* get the factory-burned MAC address */
  /* Copy 4 bytes starting from index 2 of baseMac into myNodeID */
  memcpy((void*)myNodeID, &baseMac[2], 4);

  Serial.print("[INIT] Node ID extracted: ");
  for(int i = 0; i < 4; i++) {
    Serial.printf("%02X ", myNodeID[i]);
  }
  Serial.println();
}

/**
 * @brief Sets up the node info based on the node type
 * @details Configure information on the node and submodules based on the node type and data provided by the user
 *
 * @param nodeType
 */

