gordonthree/esp32-canbus-node-v3/src/main.cpp
void wifiOnConnect(){
  Serial.println("[WIFI] STA Connected");
  Serial.print("[WIFI] STA SSID: ");
  Serial.println(WiFi.SSID());
  Serial.print("[WIFI] STA IPv4: ");
  Serial.println(WiFi.localIP());
  wifiIP = WiFi.localIP().toString();
}

/* when wifi disconnects */
void wifiOnDisconnect(){
  Serial.println("[WIFI] STA disconnected, reconnecting...");
  delay(1000);
  WiFi.begin(ssid, password);
}

void WiFiEvent(WiFiEvent_t event){
    switch(event) {

        case SYSTEM_EVENT_AP_START:
            /* set ap hostname here */
            WiFi.softAPsetHostname(AP_SSID);
            /* enable ap ipv6 here */
            WiFi.softAPenableIpV6();
            break;

        case SYSTEM_EVENT_STA_START:
            /* set sta hostname here */
            WiFi.setHostname(AP_SSID);
            break;

        case SYSTEM_EVENT_STA_CONNECTED:
            /* enable sta ipv6 here */
            WiFi.enableIpV6();
            break;

        case SYSTEM_EVENT_AP_STA_GOT_IP6:
            /* both interfaces get the same event */
            Serial.print("STA IPv6: ");
            Serial.println(WiFi.localIPv6());
            Serial.print("AP IPv6: ");
            Serial.println(WiFi.softAPIPv6());
            break;

        case SYSTEM_EVENT_STA_GOT_IP:
            wifiOnConnect();
            wifi_connected = true;
            break;

        case SYSTEM_EVENT_STA_DISCONNECTED:
            wifi_connected = false;
            wifiOnDisconnect();
            break;

        default:
            break;
    }
}

extern "C" {
  /**
   * @brief Send a message to the CAN bus
   * @param msgid The message ID of the frame to be sent
   * @param data The data to be sent in the frame
   * @param dlc The data length code of the frame, which is the number of bytes of data to be sent
   */
  void send_message( uint16_t msgid, uint8_t *data, uint8_t dlc) {
    twai_message_t message;
    static int failCount = 0; /* tx fail counter */

    #define CAN_STD_FRAME 0      /**< 0 = standard frame, 1 = extended frame */
    #define CAN_DATA_FRAME 0     /**< 0 = data frame, 1 = remote frame */
    #define CAN_NORMAL_TX 0      /**< 0 = normal transmission, 1 = SELF_RECEPTION 0 */
    #define CAN_NON_COMP_DLC 0   /**< non-compliant DLC (0-8 bytes) */
    
    /* Format message */
    message.identifier = msgid;       /**< set message ID */
    message.extd = CAN_STD_FRAME;                 /**< 0 = standard frame, 1 = extended frame */
    message.rtr = CAN_DATA_FRAME;                  /**< 0 = data frame, 1 = remote frame */
    message.self = CAN_NORMAL_TX;                 /**< 0 = normal transmission, 1 = self reception request */
    message.dlc_non_comp = CAN_NON_COMP_DLC;         /**< non-compliant DLC (0-8 bytes) */
    message.data_length_code = dlc;   /**< data length code (0-8 bytes) */

    if (dlc > CAN_MAX_DLC) dlc = CAN_MAX_DLC; /* Safety check */
    memcpy(message.data, data, dlc);  /**< copy data to message data field */

    /* Attempt transmission with a 10ms timeout */
    if (twai_transmit(&message, pdMS_TO_TICKS(10)) == ESP_OK) {
  #ifdef ESP32CYD
      digitalWrite(LED_RED, LOW); /* Turn on RED LED */
  #endif
      failCount = 0; /* Reset counter on successful queueing */
      // Serial.printf("ID: 0x%03X queued\n", msgid);
    } else {
      failCount++;
      Serial.printf("[TWAI] Tx Fail (%d/3)\n", failCount);

      if (failCount >= 3) {
        Serial.println("[TWAI] Persistent failure: Initiating TWAI Recovery...");

        /* Physical Bus Recovery Sequence */
        twai_stop();
        twai_initiate_recovery();

        vTaskDelay(pdMS_TO_TICKS(100)); /* Short delay for hardware state change */

        twai_start();
        Serial.println("[TWAI] TWAI Restarted");

        failCount = 0; /* Reset after recovery attempt */
      }
    }
    // vTaskDelay(10);
  #ifdef ESP32CYD
    digitalWrite(LED_RED, HIGH); /* Turn off RED LED */
  #endif

  } /* send_message() */
} /* extern "C" */

/** * @brief Configures LEDC hardware using the blinkerTracker_t structure.
 * @param idx  The index for both the blinker tracker and the LEDC timer (0-3).
 * @param pin  The hardware GPIO pin to use.
 * @param freq The desired frequency in Hertz (defaults to 5 Hz).
 */
void handleHardwarePwm(uint8_t submodIdx, uint8_t pin, uint32_t freq, uint32_t duty = (LEDC_13BIT_50PCT)) {
    uint8_t idx = (submodIdx - 1); /* submodule 0 will never be a blinker, so subtract 1 from index */

    /** * Safety check: Ensure index does not exceed hardware timer or array limits.
     */
    if (idx >= LEDC_MAX_TIMERS) {
        Serial.println("[PWM] Invalid index for LEDC timer, expected 0 to 3.");
        return;
    }

    /** * Cast the index to the appropriate LEDC types for the driver.
     * We map idx directly to Timer 0-3 and Channel 0-3.
     */
    ledc_timer_t selected_timer = static_cast<ledc_timer_t>(idx);
    ledc_channel_t selected_channel = static_cast<ledc_channel_t>(idx);

    /** * Update the blinkerTracker_t struct in the global array
     */
    blinkers[idx].freq     = freq;
    blinkers[idx].hwPin    = pin;
    blinkers[idx].subIdx   = submodIdx;

    /** * Configure the LEDC Timer
     */
    ledc_timer_config_t ledc_timer = {
        .speed_mode       = LEDC_LOW_SPEED_MODE,
        .duty_resolution  = LEDC_TIMER_13_BIT,     /* High resolution for low freq */
        .timer_num        = selected_timer,        /* Programmatic timer selection */
        .freq_hz          = freq,
        .clk_cfg          = LEDC_AUTO_CLK
    };
    ESP_ERROR_CHECK(ledc_timer_config(&ledc_timer));

    /** * Configure the LEDC Channel
     */
    ledc_channel_config_t ledc_channel = {
        .gpio_num       = pin,
        .speed_mode     = LEDC_LOW_SPEED_MODE,
        .channel        = selected_channel,        /* Unique channel for this output */
        .intr_type      = LEDC_INTR_DISABLE,
        .timer_sel      = selected_timer,          /* Link channel to the specific timer */
        .duty           = duty,
        .hpoint         = 0,
        .flags          = { .output_invert = 0 }
    };
    ESP_ERROR_CHECK(ledc_channel_config(&ledc_channel));
    blinkers[idx].isActive = true;                 /* Set flag indicating blinker is active */

