gordonthree/esp32-canbus-node-v3/src/main.cpp
  Serial.printf("Strobe Pattern: %d Switch: %d\n", sub.config.gpioOutput.param2, switchID);
}


static void setPWMDuty(twai_message_t& msg) { /* 0x117 */
  uint8_t switchID = msg.data[4]; /* switch ID */
  double pwmDuty = (double)(msg.data[5] * 1.0) ;  /* pwm duty from master */
  pwmDuty = (double)(pwmDuty / 100.0); /* convert to decimal */
  pwmDuty = (double)(pwmDuty * LEDC_13BIT_100PCT); /* convert to LEDC duty cycle */
  if (switchID >= MAX_SUB_MODULES) return;      /* invalid switch ID */
  subModule_t& sub     = node.subModule[switchID];  /* get submodule reference */
  const personalityDef_t* p = getPersonality(sub.personalityId); /**< Pointer to the personality definition for this sub-module */
  uint8_t pin = p->gpioPin; /* get output pin */
  uint32_t workingFreq = (uint32_t)(sub.config.gpioOutput.param1 * PWM_SCALING_FACTOR);    /* get pwm frequency */
  handleHardwarePwm(switchID, pin, workingFreq, pwmDuty);     /* update hardware */
  Serial.printf("PWM Duty: %d Switch: %d\n", pwmDuty, switchID);
}

static void setPWMFreq(twai_message_t& msg) { /* 0x118 */
  uint8_t switchID = msg.data[4];  /* switch ID */
  uint8_t pwmFreq  = msg.data[5];  /* pwm frequency */
  if (switchID >= MAX_SUB_MODULES) return;      /* invalid switch ID */
  subModule_t& sub = node.subModule[switchID];  /* get submodule reference */
  const personalityDef_t* p = getPersonality(sub.personalityId); /**< Pointer to the personality definition for this sub-module */
  uint8_t pin = p->gpioPin; /* get output pin */
  sub.config.gpioOutput.param1 = pwmFreq;       /* update pwm frequency in config */
  uint32_t workingFreq = (uint32_t)(pwmFreq * PWM_SCALING_FACTOR);
  handleHardwarePwm(switchID, pin, workingFreq);     /* update hardware */
  Serial.printf("PWM Frequency: %d Switch: %d\n", workingFreq, switchID);
}

static void txSwitchState(uint8_t* txUnitID, uint16_t txSwitchID, uint8_t swState) {
  uint8_t dataBytes[8];
  static const uint8_t txDLC = 5;

  packUint32ToBytes(node.nodeID, dataBytes); /* pack node ID into buffer */
  dataBytes[4] = (txSwitchID); /* set switch ID */
  // dataBytes[5] = (swState); /* set switch state  */

  switch (swState) {

  case OUT_STATE_OFF: // switch off
    send_message(SW_SET_OFF_ID, dataBytes, SW_SET_OFF_DLC);
    break;
  case OUT_STATE_ON: // switch on
    send_message(SW_SET_ON_ID, dataBytes, SW_SET_ON_DLC);
    break;
  case OUT_STATE_MOMENTARY: // momentary press
    send_message(SW_MOM_PRESS_ID, dataBytes, SW_MOM_PRESS_DLC);
    break;
  default: // unsupported state
    Serial.println("Invalid switch state for transmission");
    break;
  }
}

/**
 * @brief Set the mode of a switch, does not set the state
 * @param msg The message containing the switch ID and mode
 *
 * This function takes a CAN message and sets the mode of the corresponding switch.
 * The switch can be set to one of the following modes:
 * - OUT_MODE_TOGGLE: Solid state (on/off)
 * - OUT_MODE_MOMENTARY: One-shot momentary
 * - OUT_MODE_STROBE: Strobe
 * - OUT_MODE_PWM: PWM
 * - OUT_MODE_BLINK: Same as PWM, but with slower timing
 *
 * If the switch is configured for momentary, blinking or pwm, the function will
 * set a flag for the outputTask to set the state of the switch accordingly.
 * Otherwise the function will set the state of the switch directly using the digitalWrite() function.
 *
 * @note This function will only work if the output is configured for digital output
 */
static void setSwitchMode(twai_message_t& msg) { /* 0x112 */
  uint8_t switchID = msg.data[4]; /* switch ID */
  uint8_t switchMode = msg.data[5];  /* switch mode */

  if (switchID >= MAX_SUB_MODULES) return; /* invalid switch ID */

  subModule_t& sub = node.subModule[switchID]; /* get submodule reference */

  clearPwmHardware(switchID); /* in case it was previously PWM */

  Serial.printf("Switch %d set to mode %d\n", switchID, switchMode);

  switch (switchMode) {
    case OUT_MODE_TOGGLE: // solid state (on/off)
      sub.config.gpioOutput.mode = switchMode;
      trackers[switchID].isActive = false;

      break;
    case OUT_MODE_MOMENTARY: // momentary
    case OUT_MODE_STROBE: // strobe 
      /** code handles both strobe and momentary modes */
      sub.config.gpioOutput.mode = switchMode;

      trackers[switchID].isConfigured = true;
      trackers[switchID].isActive = true;
      break;
    case OUT_MODE_BLINK:
    case OUT_MODE_PWM: // pwm and blinking
      sub.config.gpioOutput.mode = switchMode;

      trackers[switchID].isConfigured = false;
      trackers[switchID].isActive = false;

      // initPwmHardware(switchID, sub); /* call hardware setup helper*/
      break;
    default:
      Serial.println("Invalid switch mode");
      break;
  }

}

/**
 * @brief Set the state of a switch based on the configured mode
 * @param msg The message containing the switch ID and state
 * @param swState The state of the switch (OUT_STATE_OFF, OUT_STATE_ON, OUT_STATE_MOMENTARY)
 *
 * This function takes a CAN message and sets the state of the corresponding switch.
 * If the switch is configured for momentary, blinking or pwm, the function will
 * set a flag for the outputTask to set the state of the switch accordingly.
 * Otherwise the function will set the state of the switch
 * directly using the digitalWrite() function.
 *
 * @note This function will only work if the output is configured for digital output
 */
static void setSwitchState(twai_message_t& msg, uint8_t swState = OUT_STATE_OFF)
{ /* SET_SWITCH_STATE_ID */

  const uint8_t switchID = msg.data[4]; /* switch ID */

  if (switchID >= MAX_SUB_MODULES) return; /* invalid switch ID, exit function */

  subModule_t& sub = node.subModule[switchID]; /* get submodule reference */
  const personalityDef_t* p = getPersonality(sub.personalityId); /**< Pointer to the personality definition for this sub-module */

  const uint8_t outPin = p->gpioPin;

  switch (swState) {
    case OUT_STATE_OFF: // switch off
      switch (sub.config.gpioOutput.mode) {
        case OUT_MODE_MOMENTARY:
          trackers[switchID].isActive = false;
          break;
        case OUT_MODE_STROBE:
          trackers[switchID].isActive = false;
          break;
        case OUT_MODE_BLINK:
        case OUT_MODE_PWM: // pwm and blinking
          stopHardwarePwm(switchID); 
          clearPwmHardware(switchID);
          break;
        default:
          digitalWrite(outPin, LOW); /* set output driver low */
          Serial.printf("Switch %d (pin %d) OFF\n", switchID, outPin);
          break;
      }
      break;

