gordonthree/esp32-canbus-node-v3/src/main.cpp
    case OUT_STATE_ON: // switch on
      switch (sub.config.gpioOutput.mode) {
        case OUT_MODE_MOMENTARY: /* If we are in momentary mode, 'ON' should behave like a trigger */
          trackers[switchID].nextActionTime = millis() + 
            (MOM_SW_SCALING_FACTOR * sub.config.gpioOutput.param1);
          digitalWrite(outPin, HIGH); /* Ensure it starts HIGH */
          trackers[switchID].isActive = true;
          break;
        case OUT_MODE_BLINK: /* If we are in blink mode, 'ON' should behave like a trigger */
        case OUT_MODE_PWM: /* Use LEDC hardware for blinking and pwm*/
        {
          //TODO: blinkOutput is going away, need to refactor to a more generic pwmOutput instead
          uint32_t freq = (uint32_t)(sub.config.gpioOutput.param1 * BLINK_SCALING_FACTOR);
          uint8_t  pin  = outPin;
          if (freq == 0) { /* for debugging don't let the blink rate equal 0*/
            freq = 5; //TODO: FIX THIS NO MAGIC NUMBERS
            sub.config.gpioOutput.param1 = freq;
          }
          handleHardwarePwm(switchID, pin, freq);
          break;
        }

        default:
          digitalWrite(outPin, HIGH); /* set output driver high */
          Serial.printf("Switch %d (pin %d) ON\n", switchID, outPin);
          break;
      }
      break;

    case OUT_STATE_MOMENTARY: // momentary press
      /* let the output task deal with this */
      Serial.printf("Output Task Switch %d (pin %d) MOMENTARY (%dms)\n", switchID, outPin, (MOM_SW_SCALING_FACTOR * sub.config.gpioOutput.param1));

      trackers[switchID].nextActionTime = millis() + (MOM_SW_SCALING_FACTOR * sub.config.gpioOutput.param1);
      digitalWrite(outPin, HIGH); /* Ensure it starts HIGH */
      trackers[switchID].isActive = true; /* enable momentary timer */
      trackers[switchID].isConfigured = true; /* enable this output for nonblocking control*/
      break;

    default:
      Serial.println("Invalid switch state");
      break;
  }
}

/**
 * @brief Helper to configure a standard digital output submodule
 * @param idx The submodule index (0-7)
 * @param pin The GPIO pin number
 * @param mode Initial output mode or state
 */
void setupAnalogStripDigitalOut(uint8_t idx, uint8_t pin, uint8_t mode) {
  if (idx >= MAX_SUB_MODULES) return; /* Safety check against array bounds */

  subModule_t& sub           = node.subModule[idx];
  sub.introMsgId             = OUT_GPIO_DIGITAL_ID;
  sub.introMsgDLC            = OUT_GPIO_DIGITAL_DLC;
  sub.submod_flags          |= SUBMOD_FLAG_SAVE_STATE;
  sub.config.gpioOutput.mode = mode;
  // sub.dataMsgId   = SET_ANALOG_STRIP_COLOR_ID; // no longer user configured
  // sub.dataMsgDLC  = SET_ANALOG_STRIP_COLOR_DLC; // no longer user configured
  // sub.config.digitalOutput.outputPin  = pin; // no longer user configured
}

/**
 * @brief Helper to configure a standard LCD Touchscreen submodule
 * @param idx The submodule index (0-7)
 */
void setupLcdTouchscreen(uint8_t idx) {
  if (idx >= MAX_SUB_MODULES) return;

  subModule_t& sub = node.subModule[idx];
  sub.introMsgId   = DISP_TOUCHSCREEN_LCD_ID;
  sub.introMsgDLC  = DISP_TOUCHSCREEN_LCD_DLC;
  sub.submod_flags|= SUBMOD_FLAG_SAVE_STATE;
  // sub.dataMsgId   = DATA_TOUCHSCREEN_EVENT_ID;
  // sub.dataMsgDLC  = DATA_TOUCHSCREEN_EVENT_DLC;
}

/**
 * @brief Helper to configure an Analog Backlight submodule
 * @param idx The submodule index (0-7)
 * @param pin The GPIO pin for PWM/Control
 */
void setupAnalogBacklight(uint8_t idx, uint8_t pin) {
  if (idx >= MAX_SUB_MODULES) return;

  subModule_t& sub = node.subModule[idx];
  sub.introMsgId    = DISP_ANALOG_BACKLIGHT_ID;
  sub.introMsgDLC   = DISP_ANALOG_BACKLIGHT_DLC;
  sub.submod_flags |= SUBMOD_FLAG_SAVE_STATE;
  sub.config.gpioOutput.mode = OUT_MODE_TOGGLE;
  // sub.dataMsgId   = DATA_DISPLAY_MODE_ID;
  // sub.dataMsgDLC  = DATA_DISPLAY_MODE_DLC;
  // sub.config.digitalOutput.outputPin  = pin;
}

/**
 * @brief Helper to configure an ARGB LED Strip submodule
 * @param idx The submodule index (0-7)
 * @param pin The GPIO pin for the data signal
 * @param count Number of LEDs in the strip
 */
void setupArgbStrip(uint8_t idx, uint8_t pin, uint16_t count) {
  if (idx >= MAX_SUB_MODULES) return;

  subModule_t& sub = node.subModule[idx];
  sub.introMsgId    = DISP_ARGB_LED_STRIP_ID;
  sub.introMsgDLC   = DISP_ARGB_LED_STRIP_DLC;
  sub.submod_flags |= SUBMOD_FLAG_SAVE_STATE;
  // sub.config.argbLed.outputPin = pin;
  // sub.config.argbLed.ledCount  = count;
}

/**
 * @brief Helper to configure a Digital Input submodule
 * @param idx The submodule index (0-7)
 * @param pin The GPIO pin for the input
 * @param res Internal resistor mode (PULLUP, PULLDOWN, etc.)
 */
void setupDigitalInput(uint8_t idx, uint8_t pin, uint8_t res) {
  if (idx >= MAX_SUB_MODULES) return;

  subModule_t& sub = node.subModule[idx];
  sub.introMsgId    = INPUT_DIGITAL_GPIO_ID;
  sub.introMsgDLC   = INPUT_DIGITAL_GPIO_DLC;
  sub.submod_flags |= SUBMOD_FLAG_SAVE_STATE;

}

/**
 * @brief Get the current epoch time from the system clock.
 *
 * This function reads the current time from the ESP32 system clock
 * and returns it as a uint32_t representing the number of seconds
 * since the epoch (January 1, 1970, 00:00:00 UTC).
 *
 * @return uint32_t The current epoch time in seconds.
 */

static uint32_t getEpochTime() {
  /* Get time from the system clock and return it as a uint32_t */
  struct timespec newTime;

  clock_gettime(CLOCK_REALTIME, &newTime); /* Read time from ESP32 clock*/

  return (uint32_t)newTime.tv_sec;
}

/**
 * @brief Send a uint32_t on the CAN bus
 * @param bigNumber The uint32_t to be sent
 * @param canMsgId The message ID to use for transmission (default: DATA_EPOCH_ID)
 * @param dlc The data length code to use for transmission (default: DATA_EPOCH_DLC)
 *
 * This function takes a uint32_t and sends it on the CAN bus
 * with the given message ID and data length code.
 */
static void sendCanUint32(uint32_t bigNumber, uint32_t canMsgId = DATA_EPOCH_ID, uint8_t dlc = DATA_EPOCH_DLC) {
  /* Take a uint32_t and put it on the bus */
  uint8_t dataBytes[dlc];

  dataBytes[0] = myNodeID[0]; // set node ID
  dataBytes[1] = myNodeID[1]; // set node ID
  dataBytes[2] = myNodeID[2]; // set node ID
  dataBytes[3] = myNodeID[3]; // set node ID
  dataBytes[4] = (bigNumber >> 24) & 0xFF;
  dataBytes[5] = (bigNumber >> 16) & 0xFF;
  dataBytes[6] = (bigNumber >> 8) & 0xFF;
  dataBytes[7] = (bigNumber & 0xFF);

  send_message(canMsgId, (uint8_t *)dataBytes, dlc);

