gordonthree/esp32-canbus-node-v3/src/main.cpp
        sub.introMsgId    = ((message.data[5] << 8) | (message.data[6] & 0xFF));    /* bytes 5:6 hold the intro message ID */
        sub.introMsgDLC   = message.data[7];                               /* byte 7 holds the intro message DLC */
        Serial.printf("Update Sub %d INTRO MSG: 0x%03X DLC: %d\n", modIdx, sub.introMsgId, sub.introMsgDLC);
      }

      break;

    case CFG_ARGB_STRIP_ID:                                                     /* setup ARGB channel */
      {
        uint8_t modIdx = message.data[4];                                         /* byte 4 holds the sub module index */
        if (modIdx >= MAX_SUB_MODULES) {
          Serial.printf("Invalid sub module index %d\n", modIdx);
          return;
        }
        subModule_t& sub = node.subModule[modIdx];
        sub.config.argb.reserved   = message.data[5];       /* reserved, not used */
        sub.config.argb.ledCount   = message.data[6];       /* byte 6 holds the number of LEDs (max 255)*/
        sub.config.argb.colorOrder = message.data[7];       /* byte 7 holds the color order */
      }
      break;
    case CFG_DIGITAL_INPUT_ID: /**< Setup digital input channel */
      {
        uint8_t modIdx = message.data[4];
        if (modIdx >= MAX_SUB_MODULES) {
          Serial.printf("Invalid sub module index %d\n", modIdx);
          return;
        }
        subModule_t& sub = node.subModule[modIdx];

        sub.config.gpioInput.pull     = message.data[5];  /* Input resistor configuration */
        sub.config.gpioInput.invert   = message.data[6];  /* logical inversion flag */
        sub.config.gpioInput.reserved = message.data[7]; /* resesrved, not used */

      }
      break;

    case CFG_ANALOG_INPUT_ID: /**< Setup analog ADC input channel */
      {
        uint8_t modIdx = message.data[4];
        if (modIdx >= MAX_SUB_MODULES) {
          Serial.printf("Invalid sub module index %d\n", modIdx);
          return;
        }
        subModule_t& sub = node.subModule[modIdx];

        sub.config.analogInput.overSampleFlag = message.data[5];
        sub.config.analogInput.reserved1      = message.data[6]; /* store reserved byte if sent */
        sub.config.analogInput.reserved2      = message.data[7]; /* store reserved byte if sent */
      }
      break;

    case CFG_BLINK_OUTPUT_ID: /**< Setup blinking/strobing output channel */
    case CFG_PWM_OUTPUT_ID: /**< Setup PWM output channel */
    case CFG_DIGITAL_OUTPUT_ID: /**< Setup digital output channel (relays/mosfets) */
      {
        uint8_t modIdx = message.data[4];
        if (modIdx >= MAX_SUB_MODULES) {
          Serial.printf("Invalid sub module index %d\n", modIdx);
          return;
        }
        subModule_t& sub = node.subModule[modIdx];

        sub.config.gpioOutput.mode   = message.data[5]; /* output mode, see defines */
        sub.config.gpioOutput.param1 = message.data[6]; /* paramater byte 0 (varies) */
        sub.config.gpioOutput.param2 = message.data[7]; /* parameter byte 1 */
      }
      break;

    case CFG_ANALOG_STRIP_ID: /**< Setup analog RGB/RGBW strip */
      {
        uint8_t modIdx = message.data[4];
        if (modIdx >= MAX_SUB_MODULES) {
          Serial.printf("Invalid sub module index %d\n", modIdx);
          return;
        }
        subModule_t& sub = node.subModule[modIdx];

        sub.config.analogStrip.configIndex = message.data[5];
        sub.config.analogStrip.reserved1   = message.data[6];
        sub.config.analogStrip.reserved2   = message.data[7];
      }
      break;

    case CFG_ANALOG_OUTPUT_ID: /**< Setup analog DAC output channel */
      {
        uint8_t modIdx = message.data[4];
        if (modIdx >= MAX_SUB_MODULES) {
          Serial.printf("Invalid sub module index %d\n", modIdx);
          return;
        }
        subModule_t& sub = node.subModule[modIdx];

        sub.config.analogOutput.outputMode  = message.data[5];
        sub.config.analogOutput.param1      = message.data[6];
        sub.config.analogOutput.param2      = message.data[7];

        /** message.data[7] is reserved/padding */
      }
      break;
    case CFG_ERASE_NVS_ID: /**< 0x41B: Master requesting NVS erase */
      {
        Serial.println("Master requesting NVS erase...");
        handleEraseCfgNVS();
      }
      break;
    case CFG_REBOOT_ID: /**< 0x41C: Master requesting reboot */
      {
        Serial.println("Master requested reboot, rebooting...");
        vTaskDelay(pdMS_TO_TICKS(100)); /* Short sleep before reboot */
        ESP.restart();
      }
      break;
    case CFG_WRITE_NVS_ID: /**< 0x41D: Master requesting NVS commit */
      {

        uint16_t masterCrc = (message.data[4] << 8) | message.data[5];
        uint16_t localCrc  = getConfigurationCRC(node);

        uint8_t responseData[6];
        /** Prepare response: [NodeID_B0..B3] [CRC_Hi] [CRC_Lo] */
        packUint32ToBytes(node.nodeID, &responseData[0]);
        responseData[4] = (uint8_t)(localCrc >> 8);
        responseData[5] = (uint8_t)(localCrc & 0xFF);

        /** CRCs match, attempt to persist to flash */
        if (saveConfigNvs(node) == CFG_OK) {
            /** SUCCESS: Set the flag indicating config is valid and send back the verified CRC */
            FLAG_VALID_CONFIG = true;
            send_message(DATA_CONFIG_CRC_ID, responseData, DATA_CONFIG_CRC_DLC);
            Serial.println("NVS Commit Successful");
        } else {
            /** Flash hardware error */
            send_message(DATA_CFGWRITE_FAILED_ID, responseData, DATA_CFGWRITE_FAILED_DLC);
            Serial.println("NVS Commit Failed: Flash Error");
        }
      }
      break;
    case CFG_READ_NVS_ID: /**< 0x41E: Master requesting NVS read */
      {
        Serial.println("NVS Read Request");
        uint16_t masterCrc = (message.data[4] << 8) | message.data[5];

        handleReadCfgNVS();

        uint16_t localCrc  = getConfigurationCRC(node);
        uint8_t responseData[6];

        /** Prepare response: [NodeID_B0..B3] [CRC_Hi] [CRC_Lo] */
        packUint32ToBytes(node.nodeID, &responseData[0]);
        responseData[4] = (uint8_t)(localCrc >> 8);
        responseData[5] = (uint8_t)(localCrc & 0xFF);

        send_message(DATA_CONFIG_CRC_ID, responseData, DATA_CONFIG_CRC_DLC);
      }
      break;
    case REQ_NODE_INTRO_ID:
      Serial.println("Interface intro request, responding with our introduction");
      // FLAG_SEND_INTRODUCTION = true; /* set flag to send introduction message */
      introMsgPtr = 0;               /* reset introduction message pointer */
      sendIntroduction(introMsgPtr); /* send the introduction message immediately */
      break;
    case ACK_INTRO_ID:
      Serial.println("Received introduction acknowledgement, advance pointer");
      introMsgPtr++;
      /* Sequence length is now 1 (node) + 2 messages per submodule */
      if (introMsgPtr > (node.subModCnt * 2)) {
          introMsgPtr = 0;
      }
      sendIntroduction(introMsgPtr);
      break;
    case DATA_EPOCH_ID:
      {
      // Use explicit casting to prevent shift overflow
      uint32_t epochTime;
      epochTime = ((uint32_t)message.data[4] << 24) |
                  ((uint32_t)message.data[5] << 16) |
                  ((uint32_t)message.data[6] << 8)  |
                   (uint32_t)message.data[7];
      setEpochTime((uint32_t)epochTime);
      Serial.println("Received epoch from master; updating clock");
      }
      break;

      case COLORPICKER_ADD_ROUTE_ID: /* 0x433: colorpicker add node */
      case COLORPICKER_DEL_ROUTE_ID: /* 0x432: colorpicker del node */
      case COLORPICKER_PURGE_LIST_ID: /* 0x431: colorpicker purge list */
      case COLORPICKER_SEND_LIST_ID: /* 0x430: colorpicker send list */
      case COLORPICKER_WRITE_NVS_ID: /* 0x42F: colorpicker write nvs */
      case COLORPICKER_READ_NVS_ID: /* 0x42E: colorpicker read nvs */
        manageColorPickerList(message);
      break;

    default:
      Serial.printf("Unknown message received 0x%x\n", message.identifier);
      // sendIntroack();
      break;
  }
} // end of void handleCanRX()

void updateVirtualSubmodules()
{
    for (uint8_t i = 0; i < node.subModCnt; i++)
    {
        subModule_t sub = node.subModule[i];

        // Skip non-virtual submodules
        if (!(sub.submod_flags & SUBMOD_FLAG_VIRTUAL))
            continue;

        uint32_t value = 0;

