gordonthree/esp32-canbus-node-v3/src/main.cpp
        switch (sub.personalityId)
        {
            case VIRT_FREE_HEAP:
                value = (uint32_t)xPortGetFreeHeapSize();
                break;

            case VIRT_WIFI_RSSI:
                value = (uint32_t)WiFi.RSSI();
                break;

            case VIRT_RTOS_HIGHWATERMARK:
                value = (uint32_t)uxTaskGetStackHighWaterMark(NULL);
                break;

            case VIRT_INTERNAL_TEMPERATURE:
                value = (uint32_t)temperatureRead();
                break;

            case VIRT_VREF_VOLTAGE:
                // value = (uint32_t)readInternalVref();
                value = 1024; // TODO: implement actual function
                break;

            default:
                // Unknown virtual personality — ignore safely
                continue;
        }

        sub.runTime.adc_value      = value;
        sub.runTime.last_change_ms = millis();  // optional
    }
}


static void handleProducerTick(uint32_t now)
{
    /** Check for producer event */
    producer_event_t evt = producerTick(now); 

    if (evt.error) {
        Serial.println("[ERR] ProducerTick returned error, aborting producer processing");
        return;
    }
    if (!evt.ready)
        return;

    if (evt.sub_idx >= node.subModCnt) {
        Serial.printf("[ERR] ProducerTick: bad sub_idx %u (max %u)\n",
                      evt.sub_idx, node.subModCnt - 1);
        return;
    }        

    /** Lookup personality */
    const subModule_t      &sub = node.subModule[evt.sub_idx];
    const personalityDef_t *p = &g_personalityTable[sub.personalityIndex];
    // const personalityDef_t *p   = getPersonality(sub.personalityId);
    if (!p) {
        Serial.printf("Producer: personality lookup failed for sub %u\n", evt.sub_idx);
        return;
    }

    uint8_t dlc = p->dataMsgDlc;
    if (dlc < CAN_DATAMSG_MIN_DLC) dlc = CAN_DATAMSG_MIN_DLC;  /**< enforce minimum DLC for producer messages 6-bytes */
    if (dlc > CAN_MAX_DLC) dlc = CAN_MAX_DLC; /**< enforce maximum DLC */

    uint8_t payload[CAN_MAX_DLC] = {0}; /**< zero-initialize */

    /* Node ID (big-endian) */
    payload[0] = (node.nodeID >> BYTE_SHIFT3) & BYTE_MASK;
    payload[1] = (node.nodeID >> BYTE_SHIFT2) & BYTE_MASK;
    payload[2] = (node.nodeID >> BYTE_SHIFT)  & BYTE_MASK;
    payload[3] = (node.nodeID)                & BYTE_MASK;

    /* Submodule index */
    payload[4] = evt.sub_idx;

    /* Scalar value (big-endian) */
    if (dlc > 5) payload[5] = (evt.value >> BYTE_SHIFT2) & BYTE_MASK;
    if (dlc > 6) payload[6] = (evt.value >> BYTE_SHIFT)  & BYTE_MASK;
    if (dlc > 7) payload[7] = (evt.value)                & BYTE_MASK;

    /* Send message */
    send_message(p->dataMsgId, payload, dlc);

    Serial.printf("ProducerTx: sub %u msg 0x%03X dlc %u val %u\n",
                  evt.sub_idx, p->dataMsgId, dlc, evt.value);
}


/**
 * @brief Manages periodic transmissions in TaskTWAI
 */
void managePeriodicMessages() {
    static uint32_t lastHeartbeat = 0;
    static uint32_t lastIntro = 0;
    uint32_t currentMillis = millis();

    /** Introduction as Heartbeat - Every 10 Seconds
        We send this as the heartbeat to save bandwidth,
        unless FLAG_SEND_INTRODUCTION is manually set by a Master request. */
    if (currentMillis - lastIntro >= 10000) {
        lastIntro = currentMillis;
        Serial.printf("Sending heartbeat (ptr = %i)\n", introMsgPtr);
        sendIntroduction(0); /* send the node introduction message as heartbeat */
        readCydLdr(); /* Read CYD LDR and send that data to the bus */

        /* If we are stuck mid-sequence, reset after 10s of silence */
        if (introMsgPtr != 0) {
            Serial.println("Intro sequence timed out, resetting pointer.");
            introMsgPtr = 0;
        }
    }

  /** Update virtual submodules */
  updateVirtualSubmodules();

  /** Call the producer tick */
  handleProducerTick(currentMillis);
    
}

void TaskTWAI(void *pvParameters) {
  // give some time at boot for the cpu setup other parameters
  vTaskDelay(100 / portTICK_PERIOD_MS);
  Serial.println("[RTOS] TWAI task started.");

  /* Initialize configuration structures using macro initializers */
  twai_general_config_t g_config = TWAI_GENERAL_CONFIG_DEFAULT((gpio_num_t)TX_PIN, (gpio_num_t)RX_PIN, TWAI_MODE_NORMAL);
  twai_timing_config_t t_config = TWAI_TIMING_CONFIG_500KBITS();
  twai_filter_config_t f_config = TWAI_FILTER_CONFIG_ACCEPT_ALL(); /* accept all messages, filter in software */

  /* Install TWAI driver */
  if (twai_driver_install(&g_config, &t_config, &f_config) == ESP_OK) {
    Serial.println("[TWAI] TWAI installed.");
  } else {
    Serial.println("[TWAI] Failed to install TWAI.");
    vTaskDelete(NULL); /* <--- Safety fix */
  }

  /* Start TWAI driver */
  if (twai_start() == ESP_OK) {
    Serial.println("[TWAI] TWAI started.");
  } else {
    Serial.println("[TWAI] Failed to start TWAI, reboot recommended.");
    vTaskDelete(NULL); /* <--- Safety fix */
  }

  /* Reconfigure alerts to detect frame receive, Bus-Off error and RX queue full states */
  uint32_t alerts_to_enable = TWAI_ALERT_RX_DATA | TWAI_ALERT_ERR_PASS | TWAI_ALERT_RX_QUEUE_FULL | TWAI_ALERT_TX_IDLE | TWAI_ALERT_TX_SUCCESS | TWAI_ALERT_TX_FAILED | TWAI_ALERT_BUS_ERROR;
  if (twai_reconfigure_alerts(alerts_to_enable, NULL) == ESP_OK) {
    Serial.println("[TWAI] TWAI alerts reconfigured.");
  } else {
    Serial.println("[TWAI] Failed to reconfigure alerts.");
    vTaskDelete(NULL); /* <--- Safety fix */
  }

  /* TWAI driver is now successfully installed and started */
  can_driver_installed = true;
  // FLAG_SEND_INTRODUCTION = true; /* send an introduction message */
  introMsgPtr = 0;  /* reset the intro message pointer */
  sendIntroduction(0); /* send the first introduction message */
  int loopCount = 0;

  /** Begin main can bus RX/TX loop */
  for (;;) {
    if (!can_driver_installed || can_suspended) {
      /* Driver not installed or bus suspended */
      vTaskDelay(pdMS_TO_TICKS(100)); /* Idle the task */
      continue; /* Skip the rest of the loop */
    }
    /* Check if alert happened */
    uint32_t alerts_triggered;
    twai_read_alerts(&alerts_triggered, pdMS_TO_TICKS(10));
    twai_status_info_t twaistatus;
    twai_get_status_info(&twaistatus);

    /* Timestamps for throttling Serial output (static to persist across loops) */
    static uint32_t lastErrPassLog = 0;
    static uint32_t lastBusErrLog = 0;
    static uint32_t lastTxFailLog = 0;
    static uint32_t lastRxFullLog = 0;
    const uint32_t LOG_INTERVAL = 2000; /* Log once every 2 seconds max */

    /* Handle alerts */
    if (alerts_triggered & TWAI_ALERT_ERR_PASS) {
      if (millis() - lastErrPassLog > LOG_INTERVAL) {
        Serial.println("[TWAI] Alert: Controller has become error passive.");
        lastErrPassLog = millis();
      }
    }

