gordonthree/esp32-canbus-node-v3/src/main.cpp
    if (alerts_triggered & TWAI_ALERT_BUS_ERROR) {
      if (millis() - lastBusErrLog > LOG_INTERVAL) {
        Serial.printf("[TWAI] Alert: Bus error. Count: %d\n", twaistatus.bus_error_count);
        lastBusErrLog = millis();
      }
    }

    if (alerts_triggered & TWAI_ALERT_TX_FAILED) {
      if (millis() - lastTxFailLog > LOG_INTERVAL) {
        Serial.println("[TWAI] Alert: Transmission failed.");
        lastTxFailLog = millis();
      }
    }

    if (alerts_triggered & TWAI_ALERT_RX_QUEUE_FULL) {
      if (millis() - lastRxFullLog > LOG_INTERVAL) {
        Serial.println("[TWAI] Alert: RX queue full.");
        lastRxFullLog = millis();
      }
    }

    /* Check if message is received */
    if (alerts_triggered & TWAI_ALERT_RX_DATA) {
#ifdef ESP32CYD
      digitalWrite(LED_BLUE, LOW); /* Turn blue LED on (inverse logic) */
#endif
      /* One or more messages received. Handle all. */
      twai_message_t message;
      while (twai_receive(&message, 0) == ESP_OK) {
        handleCanRX(message); /* Process the message */
#ifdef ESP32CYD
        digitalWrite(LED_BLUE, !digitalRead(LED_BLUE)); /* Toggle blue LED */
#endif
      }
    }

    /* Send periodic messages */
    managePeriodicMessages();

    vTaskDelay(10);
#ifdef ESP32CYD
    digitalWrite(LED_BLUE, HIGH); /* Turn blue LED off (inverse logic) */
#endif

  }
}

/**
 * @brief Periodic task that manages all output-capable submodules.
 *
 * This task:
 *   - Iterates over all submodules
 *   - Skips anything that is not an output personality
 *   - Applies the behavior defined by outputMode_t
 *   - Uses trackers[] for timing-based modes (momentary, strobe)
 *
 * Runs every 10 ms → 100 Hz timing resolution.
 */
void TaskOutput(void *pvParameters)
{
    Serial.println("[RTOS] Output task started");

    for (;;)
    {
        for (int i = 0; i < MAX_SUB_MODULES; i++)
        {
          subModule_t &sub = node.subModule[i];
          const personalityDef_t* p = getPersonality(sub.personalityId); /**< Pointer to the personality definition for this sub-module */

          outputTracker_t &trk = trackers[i];

          /* Skip submodules that are not configured for output behavior */
          if (!trk.isConfigured)
            continue;

          /* Skip personalities that do not support output behavior */
          if (!(p->capabilities & CAP_OUTPUT))
            continue;

          /* Dispatch based on the configured output mode */
          switch (sub.config.gpioOutput.mode) {
            case OUT_MODE_MOMENTARY:
              handleMomentaryLogic(sub, trk);
              break;

            case OUT_MODE_STROBE:
              handleStrobeLogic(sub, trk);
              break;
            case OUT_MODE_BLINK:
            case OUT_MODE_PWM:
              /** 
               * BLINK and PWM are handled in a separate helper,
               * nothing to do here
               */
              break;

            case OUT_MODE_ALWAYS_ON:
              if (!trk.hasBeenSet) {
                digitalWrite(p->gpioPin, HIGH);
                trk.hasBeenSet = true;
              }
              break;

            case OUT_MODE_ALWAYS_OFF:
              if (!trk.hasBeenSet) {
                digitalWrite(p->gpioPin, LOW);
                trk.hasBeenSet = true;
              }
              break;

            case OUT_MODE_FOLLOW:
              /* FOLLOW mode reacts only to incoming CAN events,
                  so the output task does nothing here. */
              break;

            case OUT_MODE_TOGGLE:
              /* TOGGLE is also event-driven; nothing to do here. */
              break;

            default:
              /* Unknown mode — do nothing */
              break;
          } /* switch (sub.config.digitalOutput.outputMode) */
        } /* for (int i = 0; i < MAX_SUB_MODULES; i++) */

        /* 10 ms timing resolution */
        vTaskDelay(pdMS_TO_TICKS(10));
    }
}


void setup() {
/** clear config valid flag */ 
FLAG_VALID_CONFIG    = false;

#ifdef ESP32CYD
  pinMode(LED_BLUE, OUTPUT);
  pinMode(LED_RED, OUTPUT);
  pinMode(LED_GREEN, OUTPUT);

  digitalWrite(LED_BLUE, HIGH); /* reverse logic, high equals off */
  digitalWrite(LED_RED, HIGH);
  digitalWrite(LED_GREEN, HIGH);
#endif

  Serial.begin(115200);
  Serial.setDebugOutput(true);
  delay(2500); /* Provide time for the board's usb interface to change from flash to uart mode */

  /* Debug check for memory alignment */
  Serial.printf("\n[DEBUG] Struct Sizes - nodeInfo_t: %d, subModule_t: %d\n",
              sizeof(nodeInfo_t), sizeof(subModule_t));

  WiFi.onEvent(WiFiEvent);
  WiFi.mode(WIFI_MODE_APSTA);
  WiFi.softAP(AP_SSID);
  WiFi.begin(ssid, password);

  /* set up some clock parameters */
  setenv("TZ", DEFAULT_TIMEZONE, ENV_VAL_OVERWRITE);
  tzset();

  readMacAddress(); /**< Read the ESP32 station MAC address and program myNodeID */

  /* Initialize memory */
  Serial.println("[INIT] Initializing memory...");
  memset(&node, 0, sizeof(nodeInfo_t));                            /* Clear nodeInfo struct */
  memset(&trackers, 0, sizeof(outputTracker_t) * MAX_SUB_MODULES); /* clear outputTracker struct */
  memset(&pwmPins, 0, sizeof(uint8_t) * LEDC_MAX_TIMERS);          /* clear the array of pwm pins */

  /* Load nodeID into the nodeInfo struct */
  node.nodeID = unpackBytestoUint32((const uint8_t*)&myNodeID);

  /* Read the NVS data from flash and init hardware */
  handleReadCfgNVS();                                                 


  /** Initialize producer library callbacks */
  producerInit(&producerCB);

  /** Pretty print nodeInfo */
  // printNodeInfo(&node);
  
  #ifdef ESP32CYD
  initCYD();                                                       /* Initialize CYD interface */
  analogSetAttenuation(ADC_11db);
  pinMode(CYD_LDR, INPUT); /* Setup the LDR as an input TODO: this should be a submodule */
  #endif

  /* Start the CAN task */
  xTaskCreate(
    TaskTWAI,              /* Task function */
    "Task TWAI",           /* name of task */
    TASK_TWAI_STACK_SIZE,  /* Stack size of task */
    NULL,                  /* parameter of the task */
    tskNormalPriority,     /* priority of the task */
    &xTWAIHandle           /* Task handle to keep track of created task */
  );

  /* Start OTA task  */
  xTaskCreate(
    TaskOTA,
    "Task OTA",
    TASK_OTA_STACK_SIZE,
    NULL,
    tskHighPriority,
    NULL
  );

  /* Start the output handler task*/
  xTaskCreate(
    TaskOutput,
    "Task Output Switch",
    TASK_SWITCH_STACK_SIZE,
    NULL,
    tskLowPriority, /* lowest priority plus one */
    &xSwitchHandle
  );
}

void printWifi() {
  Serial.println("");
  Serial.print("[INIT] Connected to ");
  Serial.println(ssid);
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());
}

void loop() {
  /** Check for producer save request */
  if (g_routeSaveRequested) {
    g_routeSaveRequested = false;
    saveRoutesToNVS();
  }

  /** Check for producer load request */
  if (g_routeLoadRequested) {
    g_routeLoadRequested = false;
    loadRoutesFromNVS();
  }

  /** Check for submodule save request */
  for (int i=0; i < MAX_SUB_MODULES; i++) {
    if (node.subModule[i].submod_flags & SUBMOD_FLAG_DIRTY) {
      /** Save the submodule */
      const ConfigStatus sts = saveSubModuleNvs(node.subModule[i], i);
      if (sts == CFG_OK) {
        /** Clear the dirty flag after successful save */
        node.subModule[i].submod_flags &= ~SUBMOD_FLAG_DIRTY;
      }
    }
  }
  // NOP;
}